
recipe_boston = ['Ингредиенты:  \n 1 лист нори размером 10x7 см' '\n150 г риса' '\n500 мл рисового уксуса' '\n40 мл Мирина' 
                     '\n100 г сахара' '\n1/4 лимона' '\n10 г водорослей комбу' '\n1 порция калифорнийской смеси''\n10 г майонеза'
                     '\n40 г филе семги' '\n50 г авокадо' '\n30 г огурца' '\nЗеленый лук \n \n \n Способ приготовления: \n 1. Чтобы приготовить Бостон ролл '
                     'необходимо первым делом сварить рис. Для соуса понадобится смешать рисовый соус'
                     'сок лимона, сахар мирин, водоросли комбу. Соусом заправить сваренный рис. Подождать пока рис не станет теплым. \n 2. На лист нори выложить калифорнийскую смесь, '
                     'авокадо и огурец. После чего свернуть в ролл и придать ему квадратную форму \n 3. Рубленую семгу, '
                     'заправленную майонезом нужно также выложить на ролл. Сверху посыпать ролл зеленым луком и разрезать его на 6 частей.']

def get_boston():
    return(recipe_boston)

recipe_philadelphia = ['Ингредиенты:  \n Рис для суши - 120 г  \n' 'Сухие водоросли нори - 1 г \n'
                       'Авокадо - 1 штука  \n' 'Лосось - 60 г \n' 'Огурцы - 1 штука \n' 
                       'Сыр филадельфия - 35 г \n' 'Васаби - по вкусу \n' 'Маринованный имбирь - по вкусу \n''Соевый соус - по вкусу. \n \n \n'
                       'Способ приготовления: \n' '1. Положите водоросли нори блестящей стороной вниз на макисо. \n' '2.' 
                       'Выложите ровным слоем рис на прессованные водоросли нори, смочив руки в тэдзу, оставляя дальний от вас край на 1 см без риса. ' 
                       'Переверните лист таким образом, чтобы рис оказался на поверхности бамбуковой циновки. \n' '3.' 
                       'Посередине водорослей нори нанесите васаби, затем сыр «Филадельфия». \n' '4. Очищенные от кожуры огурец и авокадо нарежьте на ' 
                       'полоски и выложите на середину нори. \n' '5. После наполнения ролла начните его аккуратно скручивать, затем несильно надавите на циновку.' 
                       'Прижмите на середине и сделайте брусочек из ролла. \n' '6. Нарежьте лосось тонкими кусочками и положите на ролл, слегка прижимая к нему. \n'
                       '7. Нарежьте ролл «Филадельфия» на 6 равных кусков и подавайте к столу с маринованным имбирем, васаби, соевым соусом.']

def get_philadelphia():
    return(recipe_philadelphia)


recipe_california = ['Ингредиенты:  \n Крабовые палочки - 150 г \n' 'Икра тобико - 50 г \n' 'Авокадо - 50 г \n' 'Огурцы - 1 штука \n' 
                     'Сливочный сыр - 30 г \n' 'Рис - 320 г \n' 'Сухие водоросли нори - 1 штука \n \n \n' 'Способ приготовления: \n' '1. Рис заранее отварить. \n'
                     '2. Авокадо нарезать слайсами и очистить от кожуры. \n' '3. Авокадо и огурец без кожуры нарезать тонкими длинными полосками. \n'
                     '4. Крабовые палочки разрезать на части. Добавить икру и сливочный сыр. Перемешать. \n' '5. Циновку застелить пищевой пленкой. ' 
                     'Лист нори выложить на циновку глянцевой стороной вниз. Рис равномерно распределить по всей поверхности нори. \n' '6. Перевернуть. \n'
                     '7. Посредине выложить начинку. \n' '8. С обеих сторон уложить огурцы и авокадо. \n' '9. Приподнять циновку двумя пальцами и завернуть ролл. \n'
                     '10. Равномерно распределять усилия при сворачивании ролла. Слегка прижать пальцами по бокам и сверху. \n' '11. Сверху посыпать тобико. \n'
                     '12. Прижать с обеих сторон циновкой. \n' '13. Нож смочить водой. Держа нож под углом, нарезать ролл порционными кусочками. ' 
                     'Затем снова прижать циновкой, чтобы выровнять форму. \n' '14. Выложить роллы «Калифорния» на тарелку, и можно подавать, с соевым соусом.']

def get_california():
    return(recipe_california)

recipe_peperoni = ['Ингредиенты: \n Тесто для пиццы - 1 штука \n' 'Сыр моцарелла - 250 г \n' 'Оливковое масло - 2 столовые ложки \n' 'Сырокопченая колбаса - 200 г \n'
                   'Перец чили - 1 штука \n' 'Помидоры в собственном соку - 1 банка \n' 'Орегано - 1 чайная ложка \n' 'Сушеный базилик - 1 чайная ложка \n'
                   'Чеснок - 1 зубчик \n' 'Сахар - 1 чайная ложка \n' 'Соль - по вкусу \n' 'Перец черный молотый - по вкусу \n \n \n'
                   'Способ приготовления: \n' '1. Сначала сделай соус: смешай томаты со специями, измельчённым чесноком, сахаром, солью и перцем. \n '
                   '2. Доведи до кипения и остуди. \n' '3. Раскатай тесто, смажь его оливковым маслом и соусом. \n' '4. Посыпь половиной сыра, выложи колбасу и тонко нарезанный чили. \n'
                   '5. Сверху - оставшийся сыр. \n' '6. Готовь в духовке 10-12 минут при 220 градусах. ']

def get_peperoni():
    return(recipe_peperoni)

recipe_margarita = ['Ингредиенты: \n Яйцо куриное - 1 штука \n' 'Растительное масло - 100 мл \n' 'Сахар - 1 столовая ложка \n' 'Сухие дрожжи - 10 г\n'
                    'Цельнозерновая мука - 3 стакана \n' 'Зеленый базилик - 1 пучок \n' 'Сыр моцарелла - 120 г \n' 'Помидоры - 5 штук \n' 
                    'Тертый сыр пармезан - 100 г \n' 'Чеснок - 1 зубчик \n' 'Томатная паста - 2 столовые ложки \n' 'Оливковое масло - 1 столовая ложка \n'
                    'Сушеный базилик - 1 чайная ложка \n' 'Вода - 250 мл \n' 'Соль - по вкусу \n' 'Перец черный молотый - по вкусу \n \n \n' 'Способ приготовления: \n'
                    '1. В глубокую чашу выливаем теплую воду, добавляем дрожжи, сахар, соль, растительное масло, яйцо и муку. Вымешиваем тесто до консистенции, ' 
                    'чтобы оно не прилипало к рукам и посуде. Перекладываем его в полиэтиленовый пакет и кладем в холодильник на 1 ч. \n' 
                    '2. Помидоры слегка надрезаем сверху и помещаем на 1 мин в кипящую воду. Обдаем холодной водой и снимаем кожицу. ' 
                    'Измельченную мякоть обжариваем в разогретом оливковом масле. Очищаем чеснок и пропускаем через пресс. Добавляем томатную пасту, ' 
                    'сушенный базилик и чеснок. Перемешиваем и снимаем с огня. \n' '3. Достаем тесто из холодильника и еще раз вымешиваем. ' 
                    'Делим его на три части и раскатываем лепешки. \n' '4. На каждую лепешку ровным слоем наносим соус. Печем 5 минут в духовке, ' 
                    'разогретой до 250 градусов. \n' '5. Базилик разбираем на листики. Моцареллу нарезаем кружочками. Чем тоньше ломтики моцареллы, тем вкуснее. ' 
                    'Вынимаем пиццу, раскладываем моцареллу и возвращаем в духовку на 2 минуты. Посыпаем листиками базилика, тертым пармезаном и перцем.']

def get_margarita():
    return(recipe_margarita)

recipe_ham = ['Ингредиенты: \n Тесто для пиццы - 650 г \n' 'Ветчина - 300 г \n' 'Свежие шампиньоны - 200 г \n' 'Сыр - 300 г \n' 'Соус карри - по вкусу \n \n \n'
              'Способ приготовления: \n' '1. Раскатать тесто толщиной в 0,5 мм и выложить его на противень. \n' '2. Смазать основу для пиццы соусом карри. \n'
              '3. Выложить на тесто нарезанную ветчину. \n' '4. Выложить натертые шампиньоны. \n' '5. Посыпать все сыром. \n' 
              '6. Выпекать в духовке при 220 градусах в течение 20–30 минут.']

def get_ham():
    return(recipe_ham)

recipe_sour_cream = ['Ингредиенты: \n Сгущенное молоко - 1 банка \n' 'Сахар - 100 г \n' 'Пшеничная мука - 8 столовых ложек \n' 'Сливочное масло - 100 г \n'
                     'Сметана 20%-ная - ½ кг \n' 'Какао - 1 столовая ложка \n' 'Сода - 1 чайная ложка \n' 'Яйцо куриное - 2 штуки \n \n \n' 
                     'Способ приготовления: \n' '1. Сливочное масло комнатной температуры взбейте с яйцами. Добавьте сгущенное молоко и взбейте. \n'
                     '2. Просейте муку, погасите соду уксусом и добавьте в тесто, тщательно перемешайте. \n' '3. Готовое тесто разделите на 2 части, ' 
                     'в одну часть добавьте какао, перемешайте. \n' '4. Духовку разогрейте до 180 градусов. Формы смажьте маслом, ' 
                     'испеките 2 коржа до готовности (около 20 минут). \n' '5. Приготовьте крем для торта: сметану с сахаром слегка взбейте. \n'
                     '6. Готовые коржи разрежьте на 2 части и срежьте боковые части. Все коржи сметанника, кроме нижнего проколите вилкой, ' 
                     'чтобы лучше впитывали в себя крем. \n' '7. Промажьте все коржи кремом и выложите в виде торта. ' 
                     'Обмажьте кремом и боковые части торта. \n' '8. Обрезки коржей измельчите в крошку, и посыпьте ими сметанник.' 
                     'Торт поставьте в холодильник пропитываться на ночь. \n']

def get_sour_cream():
    return(recipe_sour_cream)

recipe_medovik = ['Ингредиенты: \n Мед - 2 столовые ложки \n' 'Яйцо куриное - 2 штуки \n' 'Разрыхлитель - 1 чайная ложка \n' 'Сахар - 1 стакан \n' 
                  'Сливочное масло - 425 г \n' 'Пшеничная мука - 3,5 стакана \n' 'Грецкие орехи - по вкусу \n' 'Вареное сгущенное молоко - 1,5 банки \n \n \n'
                  'Способ приготовления: \n' '1. На водяной бане растопить 125 грамм сливочного масла, добавить сахар, мед, размешать и нагревать, ' 
                  'периодически помешивая. Нужно чтобы масса стала однородной. \n' '2. Добавить разрыхлитель ' 
                  '(если под рукой разрыхлителя нет, подойдет сода в том же объеме) и мешать до тех пор, пока масса не побелеет. Снять с бани и остудить. \n'
                  '3. Добавить яйца и хорошо размешать. Затем аккуратно ввести муку и замесить мягкое тесто. Разделить на 6-8 частей и раскатать коржи ' 
                  '(удобнее всего раскатывать тесто прямо в форме, это можно сделать ложкой, размяв его по дну, так как тесто слишком мягкое и может прилипать к скалке). ' 
                  'Выпекать коржи в нагретой до 170-180 градусов духовке примерно 5-10 минут. \n' '4. Для крема 300 грамм размягченного сливочного масла взбить миксером ' 
                  'до получения пышной массы. \n' '5. Затем, не прекращая взбивать, добавить в масло небольшими порциями вареное сгущенное молоко и снова взбить все вместе ' 
                  'до получения пышной однородной массы. \n' '6. Готовые коржи сложить друг на друга и ровно обрезать края с помощью ножа. ' 
                  'Промазать коржи кремом и сложить один на другой, последний верхний корж также обмазать кремом, бока торта — тоже.' 
                  'Украсить толчеными грецкими орехами.']

def get_medovik():
    return(recipe_medovik)

recipe_praga = ['Ингредиенты: \n Яйцо куриное - 6 штук \n' 'Яичный желток - 1 штука \n' 'Пшеничная мука - 115 г \n' 'Сахар - 150 г \n' 'Какао-порошок - 35 г \n'
                'Сливочное масло - 280 г \n' 'Сгущенное молоко - 120 г \n' 'Ванильный сахар - 7 г \n' 'Абрикосовый джем - 55 г \n' 'Шоколад - 140 г \n \n \n'
                'Способ приготовления: \n' '1. Отделить яичные желтки от белков. \n' '2. Шесть желтков взбить с 75 граммами сахарного песка в пышный светлый крем, ' 
                'а белки взбить сначала до плотной консистенции, затем добавить 75 грамм сахара и продолжать взбивать до пышности. \n'
                '3. Смешать белковую и желтковую массы, всыпать муку, просеян­ную с 25 граммами какао, тщательно перемешать. ' 
                'Вылить готовую массу в смазанную маслом и присыпанную мукой форму диаметром около 23 см. Печь в духовке, разогретой до 200 градусов, полчаса. ' 
                'Готовый бисквит остудить в форме в течение примерно пяти минут, потом перевернуть на решетку ' 
                '(она нужна для доступа воздуха — чтобы бисквит не «отмок» на тарелке и был сухим). Оставить бисквит на решетке до остывания. ' 
                'Как остынет — завернуть в пищевую пленку. \n' '4. Смешать оставшийся желток с 20 мл воды до однородности, добавить сгущенное молоко, перемешать. ' 
                'Поставить на слабый огонь и варить до загустения. Можно загустить молочно-яичную смесь и на водяной бане. Результат охладить. \n' 
                '5. Взбить 200 грамм сливочного масла с ванильным сахаром, добавить в охлажденное сгущеное молоко — добавлять надо понемногу, ' 
                'каждый раз взбивая. В конце взбивания добавить в получившийся крем 10 грамм какао-порошка. \n' '6. Бисквит разрезать на три пласта, ' 
                'смазать два из них шоколадным кремом, собрать торт. Джем подогреть, протереть его через сито и обмазать торт. \n'
                '7. Растопить шоколад и 80 грамм на водяной бане, полить торт и поставить его в холодильник на полчаса.']

def get_praga():
    return(recipe_praga)
